cache/posts/python-descriptor.html
<p>
NOTE: 以下为语音笔记，待整理
</p>


<p>
使用描述符控制python对象属性的访问。
</p>

<p>
蟒蛇中定义的所有，数据都可以，称之为，属性。比如函数和变量都是这个类的属性。具体细分一下函数是，非数据属性。而变量是数据属性。描述符用于控制变量的，获取设置和删除。根据属性的不同。描述符也可以进一步细分为数据描述，符合非数据描述符，分别用于控制，数据属性和函数属性。
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">描述符协议</h2>
<div class="outline-text-2" id="text-1">
<p>
任何一个对象只要提包含了get，set delete这三个函数，中的任意一个，那么它就是一个描述符.这三个函数分别控制，属性的获取设置和删除。
</p>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">第一数据属性以及数据描述符。</h2>
<div class="outline-text-2" id="text-2">
<p>
默认情况下，数据属性的获取顺序为，第一从对象的字典中获取，第二从类字典中获取
。
该如果定义了一个类属性对象，并且这个对象是一个描述符，则获取这个属性是会优先从这个描述符，的各个方法中获取。
</p>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">第二非数据属性。</h2>
<div class="outline-text-2" id="text-3">
<p>
静态函数，类函数都是通过描述符的方式实现的。在函数定义的时候，函数被保存在类的字典里，以一个普通的函数。函数的调用过程可以分为两个两个步骤。第一个是将函数获取出来，第二个是进行实际的调用。描述符是在第一个步骤中发挥作用。它会将，函数从类的字典中取出来，然后将类对象绑定为，第一个，参数。及成员函数的第一个参数及c f变量，都是在描述符中的钙函数中绑定的。
如果将函数的获取与调用看作两个不同的过程，则已向过则以上过程会，简化。函数本身就是一个描述符，他会返回一个新的函数，这个函数哪和原来的函数一样，但是，第一个参数会被设置为，会被设置为，对象本身。因此心身的函数，将接受的参数比原来的函数，少一个。因为函数本身也是一个描述符。
</p>
</div>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">第三描述符的一些应用。</h2>
</div>


<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">其他的一些。</h2>
<div class="outline-text-2" id="text-5">
<p>
描述服务提供了一个抽象城。这个层次控制性的，访问与设置。
所有函数是一个描述服。
累本身应该不是苗舒服。
</p>
</div>
</div>
